InformationRegisters/DigitallySignedEDKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>DigitallySignedEDKinds</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>DSCertificate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignaturesAndEncryptionKeyCertificates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EDKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DigitallySignedEDKinds/Forms/EDKindsByCertificate/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ActualEDs = ElectronicDocumentsReUse.GetEDActualKinds();
	
	For Each EDKind IN ActualEDs Do
		Rows = SignableEDKinds.FindRows(New Structure("EDKind", EDKind));
		If Rows.Count() = 0 Then
			NewRecord = SignableEDKinds.Add();
			NewRecord.DSCertificate = Parameters.Filter.DSCertificate;
			NewRecord.EDKind = EDKind;
		EndIf;
	EndDo;
	
	SignableEDKinds.Sort("EDKind");
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, StandardProcessing)
	
	If DataChanged Then
		SaveChangesAtServer();
	EndIf;
	
EndProcedure

&AtClient
Procedure UseOnChange(Item)
	
	DataChanged = True;
	
EndProcedure

&AtServer
Procedure SaveChangesAtServer()
	
	InformationRegisters.DigitallySignedEDKinds.SaveSignedEDKinds(
		SignableEDKinds.Filter.DSCertificate.Value, SignableEDKinds.Unload());
	
EndProcedure

&AtClient
Procedure SelectAll(Command)
	
	ChangeMarker(True);
	
EndProcedure

&AtClient
Procedure UncheckAll(Command)
	
	ChangeMarker(False);
	
EndProcedure

&AtClient
Procedure ChangeMarker(Mark)
	
	For Each String IN SignableEDKinds Do
		String.Use = Mark;
	EndDo;
	DataChanged = True;
	
EndProcedure
